---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.TextTypeId
source: html/a2dd6e73-dfc6-3e6c-d3a2-bfbb1b903fa3.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.TextTypeId Property

Element id of text associated with the settings.

## Syntax (C#)
```csharp
public ElementId TextTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null